app/controllers/instants_controller.rb

SELECT * FROM `instants`
---
  def index
    @instants = Instants.all

SELECT * FROM `instants` WHERE (`instants`.`id` = 1)
---
  def show
    @instants = Instants.find(params[:id])

SELECT * FROM `instants` WHERE (`instants`.`id` = 1)
---
  def edit
    @instants = Instants.find(params[:id])

INSERT INTO "instants" ("created_at", "dbname", "title", "notes", "updated_at", "url", "version", "description") VALUES('2012-06-09 10:42:16', 'liquid_feedback', 'Test 1', 'test 1', '2012-06-09 10:42:16', 'test 1', 1, 'test1')
---
  def create
    @instants = Instants.new(params[:instants])

    respond_to do |format|
      if @instants.save

SELECT * FROM `instants` WHERE (`instants`.`id` = 1)
UPDATE `instants` SET `updated_at` = '2012-06-09 09:40:24', `notes` = 'w', `version` = 5, `dbname` = 'w', `title` = 'w', `description` = 'w' WHERE `id` = 5
---
  def update
    @instants = Instants.find(params[:id])

    respond_to do |format|
      if @instants.update_attributes(params[:instants])

SELECT * FROM `instants` WHERE (`instants`.`id` = 2)
DELETE FROM `instants` WHERE `id` = 2
---
  def destroy
    @instants = Instants.find(params[:id])
    @instants.destroy