app/controllers/permissions_controller.rb

  def index
    @permissions = Permission.all
---
SELECT * FROM `permissions`

  def show
    @permission = Permission.find(params[:id])
---
SELECT * FROM `permissions` WHERE (`permissions`.`id` = 1)

  def new
    @permission = Permission.new

    @users    = User.all
    @instants = Instants.all
---
SELECT * FROM `users`
SELECT * FROM `instants`

  def edit
    @permission = Permission.find(params[:id])
---
SELECT * FROM `permissions` WHERE (`permissions`.`id` = 1)

  def create
    if Permission.find_by_sql("select * from permissions where user_id = #{params[:permission][:user_id]} AND instants_id = #{params[:permission][:instants_id]}").count != 0 then
      flash[:error] = "Die Kompination von disem User und der Instants gib es schon!"
      redirect_to
      return
    end
    @permission = Permission.new(params[:permission])

    respond_to do |format|
      if @permission.save
---
INSERT INTO "permissions" ("invitecode_disable", "check_invite_username", "created_at", "search_fulltext_username", "updated_at", "user_id", "search_fulltext_userid", "search_fulltext_fulldetails", "check_invite_userid", "invitecode_create", "search_fulltext_yesno", "check_invite_status", "invitecode_sendusermail", "username_sendfreetextemail", "instants_id") VALUES('t', 't', '2012-06-09 10:42:43', 't', '2012-06-09 10:42:43', 1, 't', 't', 't', 't', 't', 't', 't', 't', 1)

  def update
    @permission = Permission.find(params[:id])

    respond_to do |format|
      if @permission.update_attributes(params[:permission])
---
SELECT * FROM `permissions` WHERE (`permissions`.`id` = 1)
UPDATE `permissions` SET `updated_at` = '2012-06-09 10:38:13', `check_invite_username` = 1, `search_fulltext_fulldetails` = 1, `search_fulltext_userid` = 1, `invitecode_sendusermail` = 1, `username_sendfreetextemail` = 1, `check_invite_userid` = 1, `invitecode_create` = 1, `invitecode_disable` = 1, `search_fulltext_yesno` = 1, `check_invite_status` = 1, `search_fulltext_username` = 1 WHERE `id` = 1

  def destroy
    @permission = Permission.find(params[:id])
    @permission.destroy
---
SELECT * FROM `permissions` WHERE (`permissions`.`id` = 3)
DELETE FROM `permissions` WHERE `id` = 3