app/controllers/suche_controller.rb

  def invite
    @instants  = Instants.find(params["id"])
---
SELECT * FROM `instants` WHERE (`instants`.`id` = 2)

  def fulltext
    @instants  = Instants.find(params["id"])
---
SELECT * FROM `instants` WHERE (`instants`.`id` = 2)