app/controllers/users_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = 1)
---
  def edit
    @titel = "Beutzer bearbeiten"
    @user = User.find(params[:id])

SELECT * FROM `users` WHERE (`users`.`id` = 1)
UPDATE `users` SET `updated_at` = '2012-06-09 10:32:03', `sig` = '', `note` = '', `pass` = '607ece63ac6a813d32cdda3fa8a3ba0b' WHERE `id` = 1
---
  def update
    @user = User.find(params[:id])
    respond_to do |format|
      if @user.update_attributes(params[:user])